Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/losing_your_home/home_repossession.html.txt.tmx
Source language: en
Languages: ga

source: To get a judgment order, the creditor will take their case (make a motion) to the District Court, the Circuit Court or the High Court – which court depends on the amount of money involved
ga: Chun ordú breithiúnais a fháil, caithfidh an creidiúnaí a gcás (rún a dhéanamh) a thógáil sa Chúirt Dúiche, sa Chúirt Chuarda nó san Ard-Chúirt – braitheann an chúirt ar an méid airgid atá i gceist

source: This motion may, of course, be contested by you (the debtor)
ga: Dar ndóigh, is féidir leat (an féichiúnaí) an rún seo a chonspóidiú

source: A judgment order is made if it is established that you (the debtor) owe the money in question
ga: Déantar ordú breithiúnais má bhunaítear go bhfuil an t-airgead atá i gceist dlite agat (an féichiúnaí)

source: When a judgment for the payment of money is obtained from a court, the person in whose favour the judgment is given is called a judgment creditor and the person who has to make the payment is a judgment debtor
ga: Nuair a fhaightear breithiúnas don íocaíocht airgid ó chúirt, tugtar creidiúnaí breithiúnais ar an duine atá an breithiúnas i bhfabhar agus féichiúnaí breithiúnais ar an duine a chaithfidh íocaíocht a dhéanamh

source: In general, the creditor has 12 years in which to enforce the judgment order
ga: Go ginearálta, bíonn 12 bhliain ag creidiúnaí le hordú breithiúnais a fhorghníomhú

source: Enforcing the judgment order
ga: Ordú breithiúnais a fhorghníomhú

source: The legal term for enforcing the judgment is execution
ga: An téarma dlí d’fhorfheidhmiú breithiúnais ná forghníomhú

source: Having got a judgment order, the creditor then has to get an order to execute the judgment
ga: Nuair atá ordú breithiúnais faighte, caithfidh an creidiúnaí ordú a fháil leis an mbreithiúnas a fhorghníomhú

source: The execution order entitles the creditor to enforce the judgment
ga: Tugann ordú forghníomhaithe teidlíocht don chreidiúnaí le breithiúnas a fhorghníomhú

source: A number of different execution orders are available
ga: Tá líon orduithe forghníomhaithe éagsúla ar fáil

source: Generally, execution orders remain in force for a year but may be renewed
ga: Go ginearálta, bíonn orduithe forghníomhaithe i bhfeidhm ar feadh bliana, ach is féidir iad a athnuachan

source: The execution order most commonly used to enforce a High Court judgment for a specific amount of money is an order of fieri facias (the literal meaning is “that you cause to be done” and the orders are generally called orders of fi fa) These orders are issued by the Central Office of the High Court
ga: An t-ordú forghníomhaithe is coitianta a úsáidtear le breithiúnas Ard-Chúirte do mhéid airgid ar leith a fhorghníomhú ná ordú fieri facias (an chiall liteartha ná 'go bhfuil cúis agat a dhéanamh' agus tugtar orduithe fi fa orthu go ginearálta). Bíonn na hOrduithe seo eisithe ag Príomh-Oifig na hArd-Chúirte

source: This order entitles the creditor to direct the sheriff or County Registrar (County Registrars fulfil this function in all areas except Dublin and Cork cities and counties) to seize and sell property belonging to the debtor
ga: Tugann an t-ordú teidlíocht don chreidiúnaí treorú don sirriam nó Cláraitheoir Contae (déanann Cláraitheoirí Contae an fheidhm seo a chomhlíonadh i gcontaetha agus cathracha Bhaile Átha Cliath agus Chorcaí) maoin leis an bhféichiúnaí a ghabháil agus a dhíol

source: If this fails because there is no property to seize, then the sheriff or County Registrar reports that no goods could be found to be seized (the legal phrase is to return the writ nulla bona)
ga: Má theipeann ar an ordú toisc nach bhfuil maoin ar bith le gabháil, tuairiscíonn an sirriam nó Cláraitheoir Contae nach raibh earraí ar bith le gabháil (an téarma dlí ná eascaire nulla bona a sheachadadh)

source: A judgment mortgage is frequently created when the order of fi fa fails to deliver any property
ga: Bíonn morgáiste breithiúnais cruthaithe go minic nuair a theipeann ar ordú fi fa maoin ar bith a sheachadadh

source: The judgment creditor may not look for a fi fa order at all and may create a judgment mortgage instead
ga: B’fhéidir nach gcuairdeoidh an creidiúnaí breithiúnais ordú fi fa ar chor ar bith agus d’fhéadfaí morgáiste breithiúnais a chruthú ina ionad

source: Creating a judgment mortgage involves registering the judgment as a mortgage against your property
ga: Le cruthú morgáiste breithiúnais, déantar breithiúnas a chlárú mar mhorgáiste in aghaidh do mhaoin

source: Effectively, the judgment is converted into a mortgage and this is registered in the Land Registry or Registry of Deeds
ga: Go héifeachtach, déantar an breithiúnas a thiontú ina mhorgáiste agus a chlárú le Clárlann na Talún nó Clárlann na nGníomhas

source: Registration of the judgment mortgage does not have any automatic immediate effect until the judgment creditor decides either to force a sale or to claim entitlement to the proceeds of a sale by the judgment debtor
ga: Níl aon éifeacht láithreach ag clárú an bhreithiúnais morgáiste sa ghnáthchúrsa go dtí go ndéanann an creidiúnaí breithiúnais cinneadh faoi dhíol an tí a bhrú ar aghaidh nó teidlíocht ar fháltais díol ón bhféichiúnaí breithiúnais a éileamh

source: A judgment mortgage has broadly the same effect as a conventional mortgage and can be enforced by way of a mortgage suit - see above
ga: Tá an éifeacht chéanna ag morgáiste breithiúnais go forleathan le morgáiste gnásúil agus is féidir é a fhorghníomhú trí agra morgáiste (féach thuas)

source: If you have to go to court, the Money Advice and Budgeting Service (MABS) may help you to prepare. They may tell you the type of questions you can expect from the judge and the documentation you need for your case, for example, a statement of income and expenditure
ga: Más gá duit dul chun na cúirte, d'fhéadfadh go mbeadh an tSeirbhís Bhuiséadta agus Chomhairle Airgid (MABS) ina lámh chúnta duit agus tú i mbun réitigh

source: The role of MABS has been enhanced to include a Dedicated Mortgage Arrears service in over 20 MABS locations and a Court Mentor service to offer advice and options to people facing repossession. These services were launched in December 2015
ga: D’fhéadfaidís tú a chur ar an eolas faoin saghas ceisteanna a chuirfeadh an breitheamh ort agus an cháipéisíocht a theastaíonn uait do do chás, mar shampla, ráiteas ioncaim agus caiteachais

source: The MABS Helpline 0761 07 2000 is open from 9am to 8pm, Monday to Friday
ga: Tá Líne Chabhrach MABS 0761 07 2000 ar fáil ó 9rn go 8in, Luan go hAoine

source: You can also email helpline@mabs.ie or you can make an appointment to meet a money adviser in person in one of the nationwide network of MABS offices
ga: Is féidir ríomhphost a chur ar helpline@mabs.ie nó coinne a dhéanamh chun bualadh go pearsanta le comhairleoir airgid in oifig MABS

source: If you need legal advice and representation, you may be entitled to civil legal aid, depending on your circumstances. The Abhaile scheme for people in serious mortgage arrears covers a certain amount of free legal aid and advice for eligible borrowers
ga: Ina theannta sin, féadfaidh tú teagmháil a dhéanamh le hIonad Comhairle Dlí Saor in Aisce (FLAC) chun roinnt comhairle a fháil ar pháipéir dhlíthiúla nó saincheisteanna dlíthiúla

source: You can also contact a Free Legal Advice Centre (FLAC) to get some advice on legal papers or legal issues
ga: Má theastaíonn comhairle dlí uait, d’fhéadfadh go mbeifeá i dteideal cúnamh dlí sibhialta a fháil, ag brath ar do chúinsí

source: New Beginning is a not-for-profit organisation which aims to represent people in this situation
ga: Anuas air sin, d’fhéadfadh go mbeifeá in ann ionadaíocht dhlíthiúil saor in aisce a fháil ó New Beginning, seirbhís neamhbhrabúis ag a bhfuil sé de chuspóir ionadaíocht a dhéanamh do dhaoine sa chás seo
